# CoarseScaleFillPatternColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CoarseScaleFillPatternColor Property
ParameterTypeId Class See Also
---
"Coarse Scale Fill Color"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CoarseScaleFillPatternColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CoarseScaleFillPatternColor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CoarseScaleFillPatternColor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace